sterentev/atdf-device-asm-include/inc/ATtiny828.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	OSCTCAL0B	= 0xF1		; [MEMORY MAPPED] Oscillator Temperature Calibration Register B
.equ	OSCTCAL0A	= 0xF0		; [MEMORY MAPPED] Oscillator Temperature Calibration Register A
.equ	TOCPMSA1	= 0xE9		; [MEMORY MAPPED] Timer Output Compare Pin Mux Selection 1
.equ	TOCPMSA0	= 0xE8		; [MEMORY MAPPED] Timer Output Compare Pin Mux Selection 0
.equ	TOCPMCOE	= 0xE2		; [MEMORY MAPPED] Timer Output Compare Pin Mux Channel Output Enable
.equ	DIDR3		= 0xDF		; [MEMORY MAPPED] Digital Input Disable Register 2
.equ	DIDR2		= 0xDE		; [MEMORY MAPPED] Digital Input Disable Register 2
.equ	UDR		= 0xC6		; [MEMORY MAPPED] USART I/O Data Register
.equ	UBRR		= 0xC4		; [MEMORY MAPPED] USART Baud Rate Register  Bytes
.equ	UCSRD		= 0xC3		; [MEMORY MAPPED] USART Control and Status Register D
.equ	UCSRC		= 0xC2		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSRB		= 0xC1		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSRA		= 0xC0		; [MEMORY MAPPED] USART Control and Status Register A
.equ	TWSD		= 0xBD		; [MEMORY MAPPED] TWI Slave Data Register
.equ	TWSA		= 0xBC		; [MEMORY MAPPED] TWI Slave Address Register
.equ	TWSAM		= 0xBB		; [MEMORY MAPPED] TWI Slave Address Mask Register
.equ	TWSSRA		= 0xBA		; [MEMORY MAPPED] TWI Slave Status Register A
.equ	TWSCRB		= 0xB9		; [MEMORY MAPPED] TWI Slave Control Register B
.equ	TWSCRA		= 0xB8		; [MEMORY MAPPED] TWI Slave Control Register A
.equ	OCR1B		= 0x8A		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Timer/Counter1 Output Compare Register  Bytes
.equ	ICR1		= 0x86		; [MEMORY MAPPED] Timer/Counter1 Input Capture Register  Bytes
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer/Counter1  Bytes
.equ	TCCR1C		= 0x82		; [MEMORY MAPPED] Timer/Counter1 Control Register C
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter1 Control Register A
.equ	DIDR1		= 0x7F		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	ADMUXB		= 0x7D		; [MEMORY MAPPED] The ADC multiplexer Selection Register B
.equ	ADMUXA		= 0x7C		; [MEMORY MAPPED] The ADC multiplexer Selection Register A
.equ	ADCSRB		= 0x7B		; [MEMORY MAPPED] ADC Control and Status Register B
.equ	ADCSRA		= 0x7A		; [MEMORY MAPPED] The ADC Control and Status register
.equ	ADC		= 0x78		; [MEMORY MAPPED] ADC Data Register  Bytes
.equ	PCMSK3		= 0x73		; [MEMORY MAPPED] Pin Change Mask Register 3
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter0 Interrupt Mask Register
.equ	PCMSK2		= 0x6D		; [MEMORY MAPPED] Pin Change Mask Register 2
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Mask Register 0
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	OSCCAL1		= 0x67		; [MEMORY MAPPED] Oscillator Calibration Register 32kHz
.equ	OSCCAL0		= 0x66		; [MEMORY MAPPED] Oscillator Calibration Register 8MHz
.equ	PRR		= 0x64		; [MEMORY MAPPED] Power Reduction Register
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] Clock Prescale Register
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control and Status Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	SPMCSR		= 0x37		; Store Program Memory Control and Status Register
.equ	CCP		= 0x36		; Configuration Change Protection
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	ACSRA		= 0x30		; Analog Comparator Control And Status Register A
.equ	ACSRB		= 0x2F		; Analog Comparator Control And Status Register B
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose I/O Register 2
.equ	GPIOR1		= 0x2A		; General Purpose I/O Register 1
.equ	OCR0B		= 0x28		; Timer/Counter0 Output Compare Register
.equ	OCR0A		= 0x27		; Timer/Counter0 Output Compare Register
.equ	TCNT0		= 0x26		; Timer/Counter0
.equ	TCCR0B		= 0x25		; Timer/Counter Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter  Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Read/Write Access
.equ	EEARL		= 0x21		; EEPROM Read/Write Access
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose I/O Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	TIFR1		= 0x16		; Timer/Counter Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter0 Interrupt Flag register
.equ	PHDE		= 0x14		; Port High Drive Enable Register
.equ	PUED		= 0x0F		; Pull-up Enable Control Register
.equ	PORTD		= 0x0E		; Port D Data Register
.equ	DDRD		= 0x0D		; Data Direction Register, Port D
.equ	PIND		= 0x0C		; Port D Input Pins
.equ	PUEC		= 0x0B		; Pull-up Enable Control Register
.equ	PORTC		= 0x0A		; Port C Data Register
.equ	DDRC		= 0x09		; Data Direction Register, Port C
.equ	PINC		= 0x08		; Port C Input Pins
.equ	PUEB		= 0x07		; Pull-up Enable Control Register
.equ	PORTB		= 0x06		; Port B Data Register
.equ	DDRB		= 0x05		; Data Direction Register, Port B
.equ	PINB		= 0x04		; Port B Input Pins
.equ	PUEA		= 0x03		; Pull-up Enable Control Register
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Data Direction Register, Port A
.equ	PINA		= 0x00		; Port A Input Pins


; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)



