sterentev/atdf-device-asm-include/inc/ATtiny828.inc
; ----------	Register TCCR1C bits		------------------------
.equ	FOC1A		= 7		; 0x80 - 
.equ	FOC1B		= 6		; 0x40 - 

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset Timer/Counter1 and Timer/Counter0



; ====	TOCPM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TOCPMSA1 bits		------------------------
.equ	TOCC7S_MASK	= 0xC0		;      - Timer Output Compare Channel 7 Selection Bits (2 bits)
.equ	TOCC7S0		= 6		;          TOCC7S BIT0 position
.equ	TOCC6S_MASK	= 0x30		;      - Timer Output Compare Channel 6 Selection Bits (2 bits)
.equ	TOCC6S0		= 4		;          TOCC6S BIT0 position
.equ	TOCC5S_MASK	= 0x0C		;      - Timer Output Compare Channel 5 Selection Bits (2 bits)
.equ	TOCC5S0		= 2		;          TOCC5S BIT0 position
.equ	TOCC4S_MASK	= 0x03		;      - Timer Output Compare Channel 4 Selection Bits (2 bits)
.equ	TOCC4S0		= 0		;          TOCC4S BIT0 position

; ----------	Register TOCPMSA0 bits		------------------------
.equ	TOCC3S_MASK	= 0xC0		;      - Timer Output Compare Channel 3 Selection Bits (2 bits)
.equ	TOCC3S0		= 6		;          TOCC3S BIT0 position
.equ	TOCC2S_MASK	= 0x30		;      - Timer Output Compare Channel 2 Selection Bits (2 bits)
.equ	TOCC2S0		= 4		;          TOCC2S BIT0 position
.equ	TOCC1S_MASK	= 0x0C		;      - Timer Output Compare Channel 1 Selection Bits (2 bits)
.equ	TOCC1S0		= 2		;          TOCC1S BIT0 position
.equ	TOCC0S_MASK	= 0x03		;      - Timer Output Compare Channel 0 Selection Bits (2 bits)
.equ	TOCC0S0		= 0		;          TOCC0S BIT0 position

; ----------	Register TOCPMCOE bits		------------------------
.equ	TOCC7OE		= 7		; 0x80 - Timer Output Compare Channel 7 Output Enable
.equ	TOCC6OE		= 6		; 0x40 - Timer Output Compare Channel 6 Output Enable
.equ	TOCC5OE		= 5		; 0x20 - Timer Output Compare Channel 5 Output Enable
.equ	TOCC4OE		= 4		; 0x10 - Timer Output Compare Channel 4 Output Enable
.equ	TOCC3OE		= 3		; 0x08 - Timer Output Compare Channel 3 Output Enable
.equ	TOCC2OE		= 2		; 0x04 - Timer Output Compare Channel 2 Output Enable
.equ	TOCC1OE		= 1		; 0x02 - Timer Output Compare Channel 1 Output Enable
.equ	TOCC0OE		= 0		; 0x01 - Timer Output Compare Channel 0 Output Enable



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUXA bits		------------------------
.equ	MUX_MASK	= 0x1F		;      - Analog Channel Selection Bits 4:0 (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position

; ----------	Register ADMUXB bits		------------------------
.equ	REFS		= 5		; 0x20 - Reference Selection Bit
.equ	MUX5		= 0		; 0x01 - Analog Channel Selection Bit 5

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
.equ	ADLAR		= 3		; 0x08 - 
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Sources (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event

; ----------	Register DIDR3 bits		------------------------
.equ	ADC27D		= 3		; 0x08 - ADC27 Digital input Disable
.equ	ADC26D		= 2		; 0x04 - ADC26 Digital input Disable
.equ	ADC25D		= 1		; 0x02 - ADC25 Digital input Disable
.equ	ADC24D		= 0		; 0x01 - ADC24 Digital input Disable

; ----------	Register DIDR2 bits		------------------------
.equ	ADC23D		= 7		; 0x80 - ADC23 Digital input Disable
.equ	ADC22D		= 6		; 0x40 - ADC22 Digital input Disable
.equ	ADC21D		= 5		; 0x20 - ADC21 Digital input Disable
.equ	ADC20D		= 4		; 0x10 - ADC20 Digital input Disable
.equ	ADC19D		= 3		; 0x08 - ADC19 Digital input Disable
.equ	ADC18D		= 2		; 0x04 - ADC18 Digital input Disable
.equ	ADC17D		= 1		; 0x02 - ADC17 Digital input Disable
.equ	ADC16D		= 0		; 0x01 - ADC16 Digital input Disable

; ----------	Register DIDR1 bits		------------------------
.equ	ADC15D		= 7		; 0x80 - ADC15 Digital input Disable
.equ	ADC14D		= 6		; 0x40 - ADC14 Digital input Disable
.equ	ADC13D		= 5		; 0x20 - ADC13 Digital input Disable
.equ	ADC12D		= 4		; 0x10 - ADC12 Digital input Disable
.equ	ADC11D		= 3		; 0x08 - ADC11 Digital input Disable
.equ	ADC10D		= 2		; 0x04 - ADC10 Digital input Disable
.equ	ADC9D		= 1		; 0x02 - ADC9 Digital input Disable
.equ	ADC8D		= 0		; 0x01 - ADC8 Digital input Disable

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - ADC7 Digital input Disable
.equ	ADC6D		= 6		; 0x40 - ADC6 Digital input Disable
.equ	ADC5D		= 5		; 0x20 - ADC5 Digital input Disable
.equ	ADC4D		= 4		; 0x10 - ADC4 Digital input Disable
.equ	ADC3D		= 3		; 0x08 - ADC3 Digital input Disable
.equ	ADC2D		= 2		; 0x04 - ADC2 Digital input Disable
.equ	ADC1D		= 1		; 0x02 - ADC1 Digital input Disable
.equ	ADC0D		= 0		; 0x01 - ADC0 Digital input Disable



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ACSRB bits		------------------------
.equ	HSEL		= 7		; 0x80 - Hysteresis Select
.equ	HLEV		= 6		; 0x40 - Hysteresis Level
.equ	ACNMUX_MASK	= 0x0C		;      - Analog Comparator Negative Input Multiplexer (2 bits)
.equ	ACNMUX0		= 2		;          ACNMUX BIT0 position
.equ	ACPMUX_MASK	= 0x03		;      - Analog Comparator Positive Input Multiplexer Bits 1:0 (2 bits)
.equ	ACPMUX0		= 0		;          ACPMUX BIT0 position

