sterentev/atdf-device-asm-include/inc/ATtiny828.inc
; ----------	Register UCSRB bits		------------------------
.equ	RXCIE		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN		= 4		; 0x10 - Receiver Enable
.equ	TXEN		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ2		= 2		; 0x04 - Character Size
.equ	RXB8		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB8		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSRC bits		------------------------
.equ	UMSEL_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL0		= 6		;          UMSEL BIT0 position
.equ	UPM_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM0		= 4		;          UPM BIT0 position
.equ	USBS		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ0		= 1		;          UCSZ BIT0 position
.equ	UCPOL		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL	:::: bitfield values
;			0x00		; Asynchronous Operation
;			0x40		; Synchronous Operation
; ::::  UPM	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSRD bits		------------------------
.equ	RXSIE		= 7		; 0x80 - USART RX Start Interrupt Enable
.equ	RXS		= 6		; 0x40 - USART RX Start Flag
.equ	SFDE		= 5		; 0x20 - USART RX Start Frame Detection Enable




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 26
.equ	INT_VECTORS_SIZE	= 0x34
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	PCINT0		; Pin Change Interrupt Request 0
;	4	PCINT1		; Pin Change Interrupt Request 1
;	5	PCINT2		; Pin Change Interrupt Request 2
;	6	PCINT3		; Pin Change Interrupt Request 3
;	7	WDT		; Watchdog Time-out Interrupt
;	8	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	9	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	10	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	11	TIMER1_OVF	; Timer/Counter1 Overflow
;	12	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	13	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	14	TIMER0_OVF	; Timer/Counter0 Overflow
;	15	SPI_STC		; SPI Serial Transfer Complete
;	16	USART_START	; USART, Start
;	17	USART_RX	; USART Rx Complete
;	18	USART_UDRE	; USART, Data Register Empty
;	19	USART_TX	; USART Tx Complete
;	20	ADC		; ADC Conversion Complete
;	21	EE_READY	; EEPROM Ready
;	22	ANALOG_COMP	; Analog Comparator
;	23	TWI_SLAVE	; Two-wire Serial Interface
;	24	SPM_Ready	; Store Program Memory Read
;	25	QTRIP		; Touch Sensing



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATtiny828.inc"
;#	
;#	; FUSES EXTENDED byte (addr 0x02)
;#	.set	BOOTSZ		= 0x06	; Boot Flash size=128 words Boot address=$0F80
;#	.set	BODPD		= 0xC0	; Disabled
;#	.set	BODACT		= 0x30	; Disabled
;#	.set	FUSES_EXTENDED	= 0xFF \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST) \
;#				  &  (~BODPD_MASK | BODPD) \
;#				  &  (~BODACT_MASK | BODACT)
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BODLEVEL	= 0x07	; Brown-out detection disabled
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<RSTDISBL) \
;#				  & ~(0 <<DWEN) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BODLEVEL_MASK | BODLEVEL)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	SUT_CKSEL	= 0x32
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(1 <<CKDIV8) \
;#				  & ~(0 <<CKOUT) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "EXTENDED	", FUSES_EXTENDED
;#	.message "HIGH		", FUSES_HIGH
;#	.message "LOW		", FUSES_LOW
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; PCINT3	 - Pin Change Interrupt Request 3
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; USART_START	 - USART, Start
;#		reti			; USART_RX	 - USART Rx Complete
;#		reti			; USART_UDRE	 - USART, Data Register Empty
;#		reti			; USART_TX	 - USART Tx Complete
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; ANALOG_COMP	 - Analog Comparator
;#		reti			; TWI_SLAVE	 - Two-wire Serial Interface
;#		reti			; SPM_Ready	 - Store Program Memory Read
;#		reti			; QTRIP		 - Touch Sensing
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY828_INC_ */

; ************************ END OF FILE *********************************

